/*
 * @Date: 2020-07-07 16:34:17
 * @LastEditors: Please set LastEditors
 * @LastEditTime: 2020-10-16 15:08:47
 * @FilePath: \jiudian\src\assets\languages\frontOffice\ri.js
 */
module.exports = {
    saveGoon: '保存後引き続き新規チェックイン手続きを取り扱う',
    nightAudit: {
        reservationNumber: '予約番号',
        checkInTime: 'チェックイン時間',
        arriveTime: '到着時間',
        todayPrice: '本日房价',
        priceDifference: '房价差异',
    },

    //发展途径
    getWay: {
        "1": 'オンライン',
        "2": 'オフライン'
    },

    // state 卡状态 1正常(已发卡) 2已挂失 3.待启用
    state: {
        "1": '正常(已发卡)',
        "2": '已挂失',
        "3": "待启用"
    },
    // 是否黑名单 1否 2是 Integer非必填
    isBlacklist: {
        "1": '否',
        "2": '是'
    },
    priceType: {
        "1": '订金',
        "2": '押金',
        "3": '收款',
        "4": '退款',
        "5": '加收全天房费',
        "6": '加收半天房费',
        "7": '损物赔偿',
        "8": '迷你吧',
        "9": '完全冲调',
        "10": '部分冲调',
        "11": '免单',
        "12": '房费',
        "13": '挂账',
        "100": '其他'
    },
    //订单类型
    orderType: {
        "0": '全部',
        "1": '滞在',
        "2": '出発予定',
        "3": '以前/履歴',
        "4": '売掛',
        "5": 'チェックアウト後精算'
    },
    leaveDate: {
        "0": '全部',
        "1": '今日',
        "2": '昨日',
        "3": '明日',
        "4": '三日後',
        // "5": '近三天',
        // "6": '近七天',
        // "7": '上月',
        // "8": '本月',
        // "9": '下月',
        "10": '期間選択'
    },
    //入住方式
    checkInRoomType: {
        "0": '全部',
        "1": '一般',
        "2": '時間貸し部屋',
        "3": '深夜部屋'
    },
}

